using System;

namespace ijuniorEducationHomework
{
    public class HomeWork18
    {
        /*
        Пользователь вводит числа, и программа их запоминает.
        Как только пользователь введёт команду sum, программа выведет сумму всех веденных чисел.
        Выход из программы должен происходить только в том случае, если пользователь введет команду exit.
        Программа должна работать на основе расширения массива.
        Внимание, нельзя использовать List<T> и Array.Resize
         */
        public static void Work()
        {
            Console.WriteLine("Меню:");
            Console.WriteLine("Введите число\n");
            Console.WriteLine("Ввведите sum для подсчета введенных чисел\n");
            Console.WriteLine("Введите exit - выход из программы\n");
        }
    }
}